from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense
import numpy as np


#2 모델
model = Sequential()
model.add(Dense(3, input_dim=1))
model.add(Dense(4))
model.add(Dense(3))
model.add(Dense(1))

model.summary()  #모델구조 반환

#노드 안에 b(y절편)도 있기 때문에 갯수가 그만큼 늘어난다 계산 시에 6,16,15,4개가 된다
# ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━┓
# ┃ Layer (type)                         ┃ Output Shape                ┃         Param # ┃
# ┡━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━┩
# │ dense (Dense)                        │ (None, 3)                   │               6 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ dense_1 (Dense)                      │ (None, 4)                   │              16 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ dense_2 (Dense)                      │ (None, 3)                   │              15 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ dense_3 (Dense)                      │ (None, 1)                   │               4 │
# └──────────────────────────────────────┴─────────────────────────────┴─────────────────┘

# Trainable params: 41 (164.00 B)
# Non-trainable params: 0 (0.00 B) 전이해학습: 학습되어있는 모델을 가져와서 붙여놓은 파라미터 수. 이미 학습시킨거여서 최적일수 있는거라 업데이트X